{
  "title": "Designing and Evaluating an Educational Recommender System with\n  Different Levels of User Control",
  "authors": [
    "Qurat Ul Ain",
    "Mohamed Amine Chatti",
    "William Kana Tsoplefack",
    "Rawaa Alatrash",
    "Shoeb Joarder"
  ],
  "published": "2025-01-22T14:14:49Z",
  "summary": "Educational recommender systems (ERSs) play a crucial role in personalizing\nlearning experiences and enhancing educational outcomes by providing\nrecommendations of personalized resources and activities to learners, tailored\nto their individual learning needs. However, their effectiveness is often\ndiminished by insufficient user control and limited transparency. To address\nthese challenges, in this paper, we present the systematic design and\nevaluation of an interactive ERS, in which we introduce different levels of\nuser control. Concretely, we introduce user control around the input (i.e.,\nuser profile), process (i.e., recommendation algorithm), and output (i.e.,\nrecommendations) of the ERS. To evaluate our system, we conducted an online\nuser study (N=30) to explore the impact of user control on users' perceptions\nof the ERS in terms of several important user-centric aspects. Moreover, we\ninvestigated the effects of user control on multiple recommendation goals,\nnamely transparency, trust, and satisfaction, as well as the interactions\nbetween these goals. Our results demonstrate the positive impact of user\ncontrol on user perceived benefits of the ERS. Moreover, our study shows that\nuser control strongly correlates with transparency and moderately correlates\nwith trust and satisfaction. In terms of interaction between these goals, our\nresults reveal that transparency moderately correlates and trust strongly\ncorrelates with satisfaction. Whereas, transparency and trust stand out as less\ncorrelated with each other.",
  "link": "http://arxiv.org/abs/2501.12894v1",
  "categories": [
    "cs.IR",
    "cs.CY",
    "cs.HC"
  ],
  "combination": "cs.CY AND cs.HC",
  "analysis": {
    "is_relevant": true,
    "relevance_score": 0.9,
    "practical_applications": "The paper discusses the development and evaluation of an educational recommender system with enhanced user control, which is highly relevant for institutions aiming to improve personalized learning experiences. By focusing on user control, this approach can be applied in the design of educational technologies to increase user engagement, transparency, and satisfaction.",
    "thought_leadership_value": "This paper provides valuable insights into the role of user control in educational technologies, potentially influencing how AI systems are designed for personal interaction and user satisfaction. It contributes to the discourse on transparent AI systems and the importance of user agency in automated processes, promoting an understanding of how these elements impact trust and satisfaction.",
    "key_insights": [
      "User control is a critical factor that enhances the perceived benefits of educational recommender systems, particularly impacting transparency and satisfaction.",
      "Increasing levels of user control correlates moderately with trust and strongly with satisfaction, emphasizing the need for interactive and user-centric design in AI applications.",
      "The study model illustrates interactions between transparency, trust, and satisfaction, highlighting the complex relationships between these goals in user-centric system design."
    ]
  }
}