{
  "title": "Development of the Critical Reflection and Agency in Computing Index",
  "authors": [
    "Aadarsh Padiyath",
    "Mark Guzdial",
    "Barbara Ericson"
  ],
  "published": "2025-01-22T18:13:05Z",
  "summary": "As computing's societal impact grows, so does the need for computing students\nto recognize and address the ethical and sociotechnical implications of their\nwork. While there are efforts to integrate ethics into computing curricula, we\nlack a standardized tool to measure those efforts, specifically, students'\nattitudes towards ethical reflection and their ability to effect change. This\npaper introduces the novel framework of Critically Conscious Computing and\nreports on the development and content validation of the Critical Reflection\nand Agency in Computing Index, a novel instrument designed to assess\nundergraduate computing students' attitudes towards practicing critically\nconscious computing. The resulting index is a theoretically grounded,\nexpert-reviewed tool to support research and practice in computing ethics\neducation. This enables researchers and educators to gain insights into\nstudents' perspectives, inform the design of targeted ethics interventions, and\nmeasure the effectiveness of computing ethics education initiatives.",
  "link": "http://arxiv.org/abs/2501.13060v1",
  "categories": [
    "cs.CY",
    "cs.HC"
  ],
  "combination": "cs.CY AND cs.HC",
  "analysis": {
    "is_relevant": true,
    "relevance_score": 0.8,
    "practical_applications": "The paper's development of a standardized tool for measuring computing students' attitudes towards ethical reflection and agency is highly relevant for educational institutions and organizations interested in integrating and assessing computing ethics within their curricula. This can lead to more effective training programs that better prepare students to handle real-world ethical issues in AI development and implementation.",
    "thought_leadership_value": "This paper contributes to thought leadership by establishing a novel framework, Critically Conscious Computing, which challenges current norms by emphasizing the importance of ethical and sociotechnical awareness in computing education. It pushes the discourse on ethics in AI and computing to focus more on student attitudes and capabilities, providing a new angle from which to approach ethics integration in technology fields.",
    "key_insights": [
      "The introduction of the Critical Reflection and Agency in Computing Index is a significant step in measuring and understanding the efficacy of ethics education in computing fields.",
      "Standardizing the measurement of students' ethical perspectives can lead to better targeted and more effective interventions in computing education.",
      "The paper highlights the importance of developing students' critical consciousness in computing, implying a need for ongoing evolution of educational practices to meet societal and ethical demands in AI and technology."
    ]
  }
}